Revit 2026 API

# DimensionSegmentArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DimensionSegmentArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
DimensionSegmentArrayIterator()
```
```fsharp
new : unit -> DimensionSegmentArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

DimensionSegmentArrayIterator Class

Autodesk.Revit.DB Namespace